VamsiCC/Sodahacks_TrashTalker/camera_test/sdkconfig.defaults
# ESP32 target
CONFIG_IDF_TARGET="esp32"

# PSRAM (required for camera + processing buffers)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Camera sensor support
CONFIG_OV2640_SUPPORT=y

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
